; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	spectrograph0 - mode
	spectrograph2 - mode
	infrared1 - mode
	GroundStation4 - direction
	Star2 - direction
	GroundStation1 - direction
	Star5 - direction
	Star3 - direction
	Star0 - direction
	GroundStation6 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 spectrograph2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 spectrograph2)
	(supports instrument4 infrared1)
	(calibration_target instrument4 GroundStation6)
	(calibration_target instrument4 Star5)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star8)
	(supports instrument5 infrared1)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 Star3)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet14)
	(supports instrument6 spectrograph2)
	(calibration_target instrument6 GroundStation6)
	(calibration_target instrument6 Star0)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet14)
)
(:goal (and
	(pointing satellite1 Star10)
	(pointing satellite2 Phenomenon12)
	(pointing satellite3 Phenomenon13)
	(have_image Star7 spectrograph2)
	(have_image Star8 spectrograph0)
	(have_image Phenomenon9 infrared1)
	(have_image Star10 infrared1)
	(have_image Planet11 spectrograph0)
	(have_image Phenomenon12 spectrograph0)
	(have_image Phenomenon13 spectrograph0)
	(have_image Planet14 spectrograph2)
	(have_image Phenomenon15 spectrograph0)
))

)

; plan
1. (turn_to satellite2 star3 planet14)
   deleted: (pointing satellite2 planet14)
   added: (pointing satellite2 star3)
   goals met: 0 of 12
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 12
3. (calibrate satellite2 instrument5 star3)
   added: (calibrated instrument5)
   goals met: 0 of 12
4. (turn_to satellite2 phenomenon9 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 phenomenon9)
   goals met: 0 of 12
5. (take_image satellite2 phenomenon9 instrument5 infrared1)
   added: (have_image phenomenon9 infrared1)
   goals met: 1 of 12
6. (turn_to satellite2 phenomenon15 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 phenomenon15)
   goals met: 1 of 12
7. (take_image satellite2 phenomenon15 instrument5 spectrograph0)
   added: (have_image phenomenon15 spectrograph0)
   goals met: 2 of 12
8. (turn_to satellite2 phenomenon13 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 phenomenon13)
   goals met: 2 of 12
9. (turn_to satellite1 groundstation6 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 groundstation6)
   goals met: 2 of 12
10. (take_image satellite2 phenomenon13 instrument5 spectrograph0)
   added: (have_image phenomenon13 spectrograph0)
   goals met: 3 of 12
11. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 3 of 12
12. (calibrate satellite1 instrument4 groundstation6)
   added: (calibrated instrument4)
   goals met: 3 of 12
13. (turn_to satellite1 planet14 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 planet14)
   goals met: 3 of 12
14. (take_image satellite1 planet14 instrument4 spectrograph2)
   added: (have_image planet14 spectrograph2)
   goals met: 4 of 12
15. (turn_to satellite1 star7 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 star7)
   goals met: 4 of 12
16. (take_image satellite1 star7 instrument4 spectrograph2)
   added: (have_image star7 spectrograph2)
   goals met: 5 of 12
17. (turn_to satellite1 star10 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star10)
   goals met: 6 of 12
18. (take_image satellite1 star10 instrument4 infrared1)
   added: (have_image star10 infrared1)
   goals met: 7 of 12
19. (turn_to satellite2 planet11 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 planet11)
   goals met: 7 of 12
20. (take_image satellite2 planet11 instrument5 spectrograph0)
   added: (have_image planet11 spectrograph0)
   goals met: 8 of 12
21. (turn_to satellite2 star8 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 star8)
   goals met: 8 of 12
22. (take_image satellite2 star8 instrument5 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 9 of 12
23. (turn_to satellite2 phenomenon12 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 phenomenon12)
   goals met: 10 of 12
24. (take_image satellite2 phenomenon12 instrument5 spectrograph0)
   added: (have_image phenomenon12 spectrograph0)
   goals met: 11 of 12
25. (turn_to satellite3 phenomenon13 planet14)
   deleted: (pointing satellite3 planet14)
   added: (pointing satellite3 phenomenon13)
   goals met: 12 of 12
